In [1]:
import sqlite3
import pandas as pd

In [2]:
#Conectar a base de datos
conn = sqlite3.connect("database.db")
cursor= conn.cursor()

In [3]:
def sql_query(query):
    return pd.read_sql(query, conn)

In [5]:
csv_path = "alumno_proyecto.csv"
df = pd.read_csv(csv_path)
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 260 entries, 0 to 259
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id_alumno     260 non-null    int64
 1   id_proyecto   260 non-null    int64
 2   calificacion  260 non-null    object
dtypes: int64(2), object(1)
memory usage: 6.2+ KB

In [6]:
table_name = "alumno_proyecto"

# Crear (o reemplazar) la tabla en la base de datos con los datos del CSV
df.to_sql(table_name, conn, if_exists="replace", index=False)

# Verificar que se ha cargado correctamente
print(sql_query(f"SELECT COUNT(*) AS total FROM {table_name}"))
sql_query(f"SELECT * FROM {table_name} LIMIT 5")

   total
0    260

   id_alumno  id_proyecto calificacion
0          1            1         Apto
1          1            2      No Apto
2          1            3         Apto
3          1            4         Apto
4          1            5         Apto

In [7]:
csv_path = "alumnos.csv"
df = pd.read_csv(csv_path)
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id_alumno       52 non-null     int64
 1   nombre          52 non-null     object
 2   email           52 non-null     object
 3   promocion       52 non-null     object
 4   fecha_comienzo  52 non-null     object
 5   campus          52 non-null     object
 6   vertical        52 non-null     object
dtypes: int64(1), object(6)
memory usage: 3.0+ KB

In [ ]:
table_name = "alumno"

# Crear (o reemplazar) la tabla en la base de datos con los datos del CSV
df.to_sql(table_name, conn, if_exists="replace", index=False)

# Verificar que se ha cargado correctamente
print(sql_query(f"SELECT COUNT(*) AS total FROM {table_name}"))
sql_query(f"SELECT * FROM {table_name} LIMIT 5")

   total
0     52

,id_alumno,nombre,email,promocion,fecha_comienzo,campus,vertical
0,1,Jafet Casals,Jafet_Casals@gmail.com,Septiembre,2023-09-18,Madrid,DS
1,2,Jorge Manzanares,Jorge_Manzanares@gmail.com,Septiembre,2023-09-18,Madrid,DS
2,3,Onofre Adadia,Onofre_Adadia@gmail.com,Septiembre,2023-09-18,Madrid,DS
3,4,Merche Prada,Merche_Prada@gmail.com,Septiembre,2023-09-18,Madrid,DS
4,5,Pilar Abella,Pilar_Abella@gmail.com,Septiembre,2023-09-18,Madrid,DS

In [9]:
csv_path = "profesores.csv"
df = pd.read_csv(csv_path)
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id_profesor  10 non-null     int64
 1   nombre       10 non-null     object
 2   rol          10 non-null     object
 3   vertical     10 non-null     object
 4   promocion    10 non-null     object
 5   campus       10 non-null     object
 6   modalidad    10 non-null     object
dtypes: int64(1), object(6)
memory usage: 692.0+ bytes

In [10]:
table_name = "profesores"

# Crear (o reemplazar) la tabla en la base de datos con los datos del CSV
df.to_sql(table_name, conn, if_exists="replace", index=False)

# Verificar que se ha cargado correctamente
print(sql_query(f"SELECT COUNT(*) AS total FROM {table_name}"))
sql_query(f"SELECT * FROM {table_name} LIMIT 5")

   total
0     10

,id_profesor,nombre,rol,vertical,promocion,campus,modalidad
0,1,Noa Yáñez,TA,DS,Septiembre,Madrid,Presencial
1,2,Saturnina Benitez,TA,DS,Septiembre,Madrid,Presencial
2,3,Anna Feliu,TA,FS,Septiembre,Madrid,Presencial
3,4,Rosalva Ayuso,TA,FS,Septiembre,Valencia,Presencial
4,5,Ana Sofía Ferrer,TA,FS,Febrero,Valencia,Presencial

In [11]:
csv_path = "proyectos.csv"
df = pd.read_csv(csv_path)
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_proyecto      10 non-null     int64
 1   nombre_proyecto  10 non-null     object
 2   vertical         10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [12]:
table_name = "proyectos"

# Crear (o reemplazar) la tabla en la base de datos con los datos del CSV
df.to_sql(table_name, conn, if_exists="replace", index=False)

# Verificar que se ha cargado correctamente
print(sql_query(f"SELECT COUNT(*) AS total FROM {table_name}"))
sql_query(f"SELECT * FROM {table_name} LIMIT 5")

   total
0     10

   id_proyecto nombre_proyecto vertical
0            1             HLF       DS
1            2             EDA       DS
2            3            BBDD       DS
3            4              ML       DS
4            5      Deployment       DS